# 1.python基础概念
# python是面向对象的解释型高级编程语言
# python是强类型的动态脚本语言
# 2. bug(程序错误）
# 注意：1.python中的符号都要用英文模式下的
#      2.缩进错误（print顶格写）
#      3.命名错误（字符串加引号）
#      4.语法错误（一行不能写两个print)
# 3. debug（解除程序错误）
#    断点调试：设置断点 逐个调试
# 4. 注释（加强程序可读性）
#    注释不会被程序执行 注释可以放在任何位置 注释内容不会被程序执行
#  4.1单行注释
#    例如print("world") #我要输出world
#  4.2多行注释（三引号包含 内容不会被执行）
#    快捷键CTRL+/ 既可以添加注释 也可取消注释
#  5. 输出
#    输出多句话或者多个值时，需要用，隔开
#    例如print("哈哈哈","喝喝喝",sep="韩思瑜")  #输出结果为 哈哈韩思瑜呵呵呵
#    sep是用来间隔多个值的参数 默认是空格
#    end是用来设定以...结尾，默认值是换行，可以改成别的
#    例如 print("hello",end="00")
#    print("world")  输出结果就是 hello00world
#    print(字符串，end="后面拼接的值”） 最后输出结果：第一个print中的字符串+后面拼接的值+第二个print中的字符串
