# # 1.if判断
# # 基本格式：
# # if 要判断的条件:
# #     满足条件要做的事情
# # age = 21
# # if age < 18:
# #     print('未成年人不得上网')
# # 如果age<18，那么打印出来的就是未成年人不得上网，反之没有反应，因为没有规定大于等于18的情况
#
# # 用户从控制台输入成绩，如果满分，输出”你真棒“，如果60分，输出”你还要加油哦“
# # score = input('请输入成绩：')
# # if score == "100":
# #     print('你真棒')
# # if score == '60':
# #     print('你还要加油哦')
#
# # 2.比较（关系）运算符(== != < > >= <=)
# # == 比较的是两个变量的值是否相等，相等的话就饭就为True,不相等的就返回为False
# # != 比较的是两个变量的值是否相等，不相等的话就饭就为True,相等的就返回为False
# a = 666
# b = 999
# # print(a != b)
# if a < b:
#     print('a小于b')
#
# # 3.逻辑运算符（and or not)
# # and 左右两边都符合才为真
# # or 只需要一边符合即为真
# # not 表示相反的结果
# # a = '计算机'
# # b = '电脑'
# # if a == '苹果手机' or b == '电脑':
# #     print('a和b都是我买不起的东西')
# print(not 3>9)   # 输出结果为True
#
# # 4.三目运算（三元表达式)
# # 基本格式： 为真结果 if 判断条件 else 为假结果
# # a = 8
# # b = 5
# # if a > b:
# #     print("a比b大")   # 为真结果
# # else:
# #     print('a比b小')  # 为假结果
# print('a比b大') if a>b else print('a比b小')  # 上述使用三目运算的结果，也能算
#
# # 5.if——else结构（二选一）
# # 基本格式：
# # if 条件:
# #     满足条件要做的事情
# # else:
# #     不满足条件时要做的事情
# a = 666
# if a == 999:
#     print('你真棒')
# else:
#     print('还要继续加油')
#
# # 6. if-elif（-else）结构（多选一）
# # if 条件1:
# #     满足条件1要做的事情
# # elif 条件2:
# #     满足条件2要做的事情
# # elif 条件3:
# #     满足条件3要做的事情
# # 注意：elif能一直写，程序运行到那个满足了条件就不会往下运行了
# score = 35
# if 85 <= score <= 100:
#     print('优秀')
# elif 70 <= score <= 85:
#     print('一般')
# elif 60 <= score <= 70:
#     print('及格')
# elif score <= 60:
#     print('你是个废物')
# else:
#     print("分数无效")
#
# # 7. if嵌套
# # 格式
# # if 条件1:
# #     事情1
# #     if 条件2:
# #         事情2
# # else:
# #     不满足条件的事情
# # 注意：内层if和外层if判断都可以是if else 、if elif结构，注意缩进
# # 举一个例子 疫情期间进火车站
# ticket = True
# temp = 38
# if ticket == True:
#     print('持票可以进站-->',end="")
#     if 37.0 <= temp <= 37.3:
#         print("体温有点高，爬进去吃点药吧吧")
#     elif 35.0 <= temp <= 37.0:
#         print("体温正常，祝您乘车愉快")
#     elif 37.3 <= temp <= 38.0:
#         print("体温不太正常，车上有医务室")
#     else:
#         print('体温异常，滚医院去吧')
# else:
#     print('没票滚出去')
