# # 1.while循环
# #  1.1基本语法
# # 定义初始变量
# # while 条件:
# #     循环体
# #     改变变量
# i = 1  # 记录循环的的次数
# while i <=8:
#     print('我是焦梓钰他爹',end='哈哈哈 ')
#     i += 1
# # 注意：如果没有改变变量，程序就进入死循环，无法停止，对电脑有损坏
# # 1.2 死循环
# # 基本格式
# # while True:
# #     循环体
# # while True:   # 条件只写True或者除0外的数字或者字符串，说明一直为真，就一直执行
# #     print('永远十八岁')
# # while False:   # 条件只写False或者0，说明一直为假，就啥也没有
# #     print('永远十八岁')
#
# # 经典例题
# # 计算从1加到100的和
# s = 0 # 定义一个变量保存计算结果，最开始为0
# i = 1
# while i <= 100:
#     s += i
#     i += 1
#     # print('计算结果是：',s)  # 每一次的相加结果都会输出，若只想要最后结果，要把print写在循环外
# print("最后结果为%4d"%s) # 输出结果就只有最后结果了
#
# # 1.3 while循环嵌套
# # 基本结构（缩进决定层级）
# # while 条件1:
# #     循环体1
# #     while 条件2:
# #         循环体2
# #         改变变量2
# #     改变变量1
# i = 1
# # while i <= 3:
# #     print(f'这是第{i}次外循环',end=" ")
# #     j = 1
# #     while j <=10:
# #         print(f'内循环{j}次',end=" ")
# #         j += 1
# #     i += 1
# # 注意：外循环循环一次，内循环循环所有次，写循环一层一层写
#
# i = 1
# while i <= 3:
#     print('韩思瑜一棒打死焦梓钰',end=" ")
#     j = 1
#     while j <=10:
#         print("焦梓钰是韩思瑜的好大儿",end=' ')
#         j += 1
#     i += 1
